"use client";
import ModalDestiny from "@/components/ModalDestiny";
import { motion } from "motion/react";
import { useRef, useState } from "react";

const Destiny = () => {
  const constraintsRef = useRef(null);
  const [isOpen, setIsOpen] = useState(false);
  const [isShaking, setIsShaking] = useState(false);
  const [selectedCard, setSelectedCard] = useState<{ id: number; description: string } | null>(null);

  const handleClick = () => {
    if (isShaking) return; // ป้องกันการกดซ้ำ
    setIsShaking(true);
    
    // สุ่มข้อมูลจาก cardData
    const randomCard = cardData[Math.floor(Math.random() * cardData.length)];
    setSelectedCard(randomCard);
    setIsOpen(true);

    setTimeout(() => {
      setIsShaking(false);
    }, 500); // จบ animation
  };

  return (
    <div className="bg-red-300 h-dvh flex flex-col items-center justify-center">
      <section className="px-8 max-w-xl mx-auto h-4/5 w-full">
        <div className="flex flex-col justify-center items-center h-full w-full">
          <h1 className="text-4xl font-bold">เซียมซี</h1>
          <p className="opacity-70 mb-12">อธิษฐานก่อนเขย่า</p>

          {/* เซียมซี Zone */}
          <div
            ref={constraintsRef}
            className="relative w-44 h-44 md:w-52 md:h-52"
          >
            <motion.button
              onClick={handleClick}
              className="w-full h-full bg-slate-200 rounded-full flex flex-col justify-center items-center"
            >
              <motion.img
                drag
                dragConstraints={constraintsRef}
                className="w-32 h-32"
                src="/image/destiny/cup.png"
                alt="เซียมซี"
                animate={isShaking ? { x: [0, -10, 10, -10, 10, 0] } : {}}
                transition={{ duration: 0.5 }}
              />
            </motion.button>
          </div>

          {/* แสดง Modal เมื่อ isOpen = true */}
          <ModalDestiny open={isOpen} setOpen={setIsOpen}>
            {selectedCard && (
                <>
                    <h2 className="text-slate-200 text-3xl text-center mb-4">เซียมซีใบที่ {selectedCard.id}</h2>
                    <p className="text-slate-300 px-6 mx-auto max-w-lg text-pretty indent-8">{selectedCard.description}</p>
                </>
            )}
          </ModalDestiny>
        </div>
      </section>
    </div>
  );
};

const cardData = [
    { 
      "id": 1,  
      "description": "ใบปฐมสมจิดอธิษฐาน จะมีผู้อุปถัมภ์แสนส่าราญ สำเร็จการที่ตรึกนึกในใจ แต่ช้า ๆ จึงจะสมอารมณ์คิด ด้วยเดชสัตย์สุจริตประสิทธิ์ให้ ทั้งพวกพ้องวงศ์ญาติปราศทุกข์ภัย มีโชคชัยได้สุขทุกคืนวัน แม้นถามถึงโชคร้ายในกายตัว อีกสักหน่อยค่อยยังชั่วอย่าโศกศัลย์ ถามลกหนี้พี่น้องต้องพบกัน ไม่ช้าวันพบพักตร์เหมือนทักทาย ลาภพิเศษเจตนาเวลานี้ นาน ๆ มีให้บ้างไม่ห่างหาย ถามเนื้อคู่ดีจริงทั้งทั้งหญิงชาย เหมือนชักนำทำทำนายเท่านี้เอย ฯ"
    },
    { 
      "id": 2, 
      "description": "ใบที่สองต้องกันเหมือนจันทร์ฉาย เปรียบเหมือนดันพฤกษาเวลาตาย ต้องสาดสายน้ำค้างในกลางคืน บริสุทธิ์สดชื่นทุกสิ่งสรรพ์ จะทำการสิ่งใดพร้อมใจกัน ไม่นานวันคงสมอารมณ์หมาย ไปข้างหน้าว่าดีพาที่ทาย คิดแยกย้ายแปรสถานไปไม่สู้ดี อยู่กับที่จะมีลาภอเนกหลาย ถามถึงคนป่วยไข้ว่าได้คลาย ถามถึงพวกพ้องพี่น้องต้องพบตรง ทั้งลูกหนี้ที่หนีหน้าจะมาสู่ แต่เนื้อคู่มิได้ชมสมประสงค์ลาภ อย่างอื่นทายตรงว่าดีเท่านี้เอย ฯ " 
    },
    { 
      "id": 3,
      "description": "ใบที่สามความยากลำบากลัน จะทำการก็ป่วยการรำคาญตน ว่ามีคนปองร้ายไม่วายวัน ถึงกินอิ่นอิ่มนอนหลับก็กลับทุกข์ ไม่มีสุขสักเวลาแทบอาสัญ แต่ถามเรื่องเป็นความไม่คร้ามกัน คงผ่อนผันสู่ได้เป็นไรมี จะไปหาผู้ใดก็ไม่ยาก ถามลูกหนี้ที่จากพลัดพรากหนี ว่ายังไม่พบกันในทันที หาลาภนี้ก็ยากลำบากกาย ถามเรื่องค์สู่สมภิรมย์พักตร์ ว่าร้ายนักฟันเพื่อนไม่เหมือนหมาย จงสงบไว้ก่อนผ่อนพักกาย หมดคำทำนายที่สามจบความเอย ฯ "
    },
    { 
      "id": 4,
      "description": "ใบที่สี่นี้ไซร้เหมือนไกลคู่ มีได้รู้ยามพบประสบสอง เหมือนลูกไก่ฝูงเดียวเที่ยวคะนอง ตัวหนึ่งต้องจากไปเสียไกลกัน ต่อนานจึงจะพบประสบพักตร์ ได้ร่วมรักปรีดิ์เปรมเกษมสันด์ จะทำการสิ่งใดพร้อมใจกัน แต่ข้อนั้นทายไว้ในนี้ว่า อย่าดำเนินเดินหน้าท่านว่าร้าย เราต้องหมายตามหลังระวังหนีเหมือนพระจันทร์ร่อนเรในเมมี อาทิตย์หนีอัสดงรีบลงดิน ถามคนเจ็บว่าหายสบายใจ ถามโชคชัยในคดีที่ดัดสิ้น คงชนะเด็ดขาดปราศมลทิน ได้ยลยินแต่สิ่งให้ใจสบาย อันความหวังตั้งไว้ไม่นานนัก ถามลูกรักในครรภ์เหมือนมั่นหมาย ว่าคงจะรู้เห็นได้เป็นชาย จบทำนายใบที่สี่เท่านี้เอย ๆ" 
    },
    { 
      "id": 5,
      "description": "ใบที่ห้าว่าไว้ในอักษร ไม่มีใครทำร้ายให้จากจร อย่าทุกข์ร้อนไปเลยไม่เคยการ ถ้าแม้นรักมักได้ควายของเขา ม้าของเราจะต้องพรากจากสถานเค้าบุราณ ดูอาการคนคประจะจบประแจง แม้ถามหาเนื้อคู่อุปมาของเก่าว่าอยู่ไกล ยังไม่ได้เหมือนจิตเร่งคิดแหนง ถามลูกหนี้หนีไปไม่ขี้แจง เสาะแสวงยากจะพบประสบกัน ถามหาลาภนี้ไซร้ก็ได้ยาก ต้องลำบากทุกข์ร้อนจงผ่อนผัน แม้นถามถามตรสดใจที่ในครรภ์ เลขห้านั้นว่าหญิง แท้จริงเอย ฯ "
    },
    { 
      "id": 6,  
      "description": "ใบที่หกนี้แจ้งแถลงสาร โชคของท่านเปรียบดังสร้างสะพาน คิดก่อการสะดวกทำข้ามทันที เวลานี้ยังนุงยุ่งลำบาก แรกลงรากต้องเหนื่อยเมื่อยเต็มที่ พอลุล่วงสำเร็จเสร็จสิ้นดี สะพานนี้จะช่วยให้หทัยสบาย ลาภของท่านนั้นหนอนั่งรอก่อน ไม่ต้องร้อนใจยุ่งมุ่งจิตหมาย ถึงเวลาแล้วจะเห็นไม่เว้นวาย ยิ่งแก่กายยิ่งสำราญบานเบิกทรวง เนื้อคู่ท่านนั้นว่าเป็นแม่หม้าย อยู่ด้วยกันแล้วสบายจะหายห่วง พร้อมสินทรัพย์ชายหญิงสิ่งทั้งปวง อีกลุล่วงทุกข์โศกโรคภัยเอย ฯ "
    },
    { 
      "id": 7,  
      "description": "ใบที่เจ็ดเสร็จทุกข์เป็นสขี ทั้งบ้านเรือนเพื่อนกินก็ยินดี แต่ตัวนี้มีกรรมไม่สำราราญ จึงทำบุญให้ทานประมาณจิต คงสมคิดสมรักสมัครสมาน อย่าอ้อมโอบโลภมากจะยากนาน ฟังบุราณท่านวางไว้อ้างอิง เหมือนปลูกผลไม่ไว้ไกลบ้าน คงไม่นานเห็นผลหล่นจากกิ่ง ถามหาลาภใบนี้ว่าดีจริง ถามหาสิ่งของหายก็ได้คืน ถามหาคู่สู่สมภิรมย์รัก ว่าดีนักแสนตีเป็นที่ชื่น ถามคนเจ็บว่าหายสบายคืน ถึงเรื่องอื่นก็ดีเท่านี้เอย ฯ "
    },
    { 
      "id": 8,  
      "description": "ใบที่แปดนี้ไซร้แม้นได้สม คงชื่นชมสุขีเป็นที่สอง เปรียบเหมือนดันพฤกษามณทาทอง รากแก้วต้องขาคไป อยู่ไม่ทน เวลานี้ก็แล้งแม้นแบ่งรับ จงเปลี่ยนกลับย้ายที่จึงมีผล ถามของหายหายากลำบากดน ถามถึงคนเคียงค์ไม่สู้ดี แม้นถามเรื่องเป็นความควรขามเช็ด ไม่สำเร็จสู้ยากต้องบากหนี ถามหาลาภเล่าไซร้ไม่สู้ดี อัญชลีตั้งใจใหม่เถิดเอย ฯ "
    },
    { 
      "id": 9,  
      "description": "ใบที่เก้าบ่งขัดตัวมัจฉา จะกลายเป็นมังกรเหมือนก่อนมา คิดไปหาลาภผลด้วยกลใด ทิศทักษิณทิศประจิมริมวิถี ว่าไปดีมาดีเป็นศรีใส เปรียบเหมือนกับนาวาที่คลาไคล ได้แล่นใบตามลมคงสมปอง ว่ามังกรกับงูยังรู้แปลง เหมือนหน้าแล้งวิดน้ำสักสามสอง คงจะได้ฟังเฟืองมีเนืองนอง ถามคนต้องพลัดพรากที่จากไป ว่าคงจะได้พบประสบพักตร์ ถามคู่รักร่วมชิดพิสมัย ว่ายังไม่ได้กันในทันใค ถามคนไข้ว่าชั่วบอกตัวตรง ถามหาลาภใบนี้ว่าดีนัก ท่านว่าจักสมจิตคิดประสงค์ จงอดสาห์หมั่นทำในทำในจำนง ที่เก้าคงว่าดีเท่านี้เอย ฯ "
    },
    { 
      "id": 10,  
      "description": "ใบที่สิบหยิบยกดกกับใบ เหมือนได้นอนหลับแล้วกลับฝัน จะพูดจาแสนยากลำบากครั้น ไม่รู้วันเป็นตายวายชีวา แม้นถามลูกในท้องต้องเป็นหญิง แม้นถามสิ่งของหายอย่าหมายหา แสนยากที่จะพบประสบดา ถามใช้ว่าหายยากลำบากกาย ถามหาคู่สู่สมภิรมย์พักตร์ ว่าคงจักได้สมอารมณ์หมาย ถามหาลาภไม่ดีเป็นที่วาย ระวังกายไว้ให้มั่นทุกวันเอย ๆ"
    },
    { 
      "id": 11,  
      "description": "ใบที่สิบเอ็ดเปรียบกันกับจันทร์ฉาย หมู่เมฆปิดมิดไว้ไม่ไกลกาย แล้วผันผายออกห่างสว่างเดิม ปางก่อนทำเท่าไรได้เท่านั้น พอสมกันสมมูลไม่พ้นเพิ่ม ข้างภายหน้าว่าดีทวีเดิม แม้นความเดิมแม่ลกไม่ถูกกัน ทำสิ่งหนึ่งสิ่งใดคงได้สม ถามค่ขมว่าดีเป็นสีส้น ถามลูกหนี้พวกพ้องพี่น้องกัน คงผ่อนผันได้สมอารมณ์ป่อง ถามหาลาภก็ดีเป็นที่ยิ่ง ถามถึงสิ่งสู้ความว่างามผ่อง ดีทั้งนั้นในนี้เหมือนสีทอง จงตรึกตรองอ่อนน้อมให้พร้อมเอย ฯ"
    },
    { 
      "id": 12,  
      "description": "ใบที่สิบสองคนหนึ่งเดินนำหน้า คนหนึ่งว่าตามหลังมาทั้งสอง เปรียบเหมือนกับคนในใจปอง พูดไม่คล่องแสนยากลำบากครั้น ว่าจะมีคนชุบอุปถัมภ์ เหมือนถ้อยคำพาที่ที่คนฝัน เวลาตื่นหายไปร้อนใจครั้น ให้ป่วนปั่นเปล่า ๆ ไม่เข้าการ ถามหาคู่ร่วมภิรมย์รัก ว่าร้ายนักจงแจ้งแถลงสาร ถามเป็นความว่าดีไม่มีปาน ถามถึงการเพื่อนรักประจักษ์ใจ ว่าคงได้สมอารมณ์นึก ที่ตื้นลึกคงแจ้งแถลงไข พบพี่ป้าถุงนำเพื่อนอาลัย ถามลาภไม่สู้ดีเท่านี้เอย ๆ "
    },
    { 
      "id": 13,  
      "description": "ใบที่สิบสามเปรียบคนเหมือนต้นไม้ ยังมีได้ผลิดอกหรือออกผล เหมือนพฤกษาหน้าแล้งต้องแฝงตนไร้น้ำฝนคนรดก็ไม่มี อย่าตัดช่องพอตัวกลัวเกียงแย่ง อย่าเคลือบแคลงจากไปให้ไกลที่ จงรอรั้งฟังว่าในพาที แม้นการมีค่อยคิดตามกิจการ จึงจะไม่เสียเรื่องให้เคืองแค้น ถ้ามาดแม้นขอบุตรสุดสงสารว่ายังไม่มีมาในอาการ ถามพบพานพวกพ้องพี่น้องมี ถามหาลาภว่าสมอารมณ์หมาย ถามถึงรายเรื่องคู่นั้นจู่จี้ ว่ายังไม่ได้กันในทันที จบใบที่สิบสามหมดความเอย ฯ "
    },
    { 
      "id": 14,  
      "description": "ใบที่สิบสี่นี้ชื่ออุบาทว์ ท่านประกาศชี้แจงแถลงไข เพื่อระวังรักษาวาจาใจ พอจะให้หนักเป็นเบาบรรเทาลง ด้วยใบนี้ได้เมื่อคราวเต่าอุบาทว์ ปากคาบไม้ยุรยาตรไปตามหงส์ เหมราชคาบได้ค้นไม้ทรง แล้วบินตรงมุ่งพาหากินกัน แต่เต่าร้ายไม่ระวังพลั้งปากตัว กล่าวคำชั่วตกลงมาถึงอาสัญ จงประหยัดวาจาอย่าดึงดัน จะเหหันเกิดภัยประลัยลง สิ่งที่ทำกรรมที่ก่อแต่พอตัว ไม่พาชั่วลำเค็ญเป็นผุยผง แต่คนชุบอุปถัมภ์จำมั่นคง อย่าทะนงเขาจะชังระวังตน เรื่องเนื้อคู่ชู้รักจักลำบาก เพราะว่าปากพูดไปแต่ไร้ผล ถามถึงลาภอนิจจังยังอับจน เนื่องด้วยผลแห่งอุบาทว์อนาถเอย ฯ "
    },
    { 
      "id": 15,  
      "description": "ใบที่สิบห้าว่าไว้ในอักษร จะทำการสิ่งใดไม่อาวรณ์ สโมสรสมประสงค์บุญส่งทัน จะค้าขายก็ดีเป็นที่สุด แม้ถามบุตรว่าเป็นชายไม่เหหัน ถามหาคู่เชยชมพอสมกัน ของหายนั้นท่านว่าหาได้คืน ถามหาลาภก็ดีเป็นที่หนึ่ง แม้นถามถึงคนไข่ไม่ฝ่าฝืน ว่าสบายได้สุขทุกวันคืน ถามอย่างอื่นลูกหนี้ก็ดีครันแม้นผู้ใดขอได้ที่ใบนี้ ว่าแสนคือดิเรกดังเสกสรร คงอยู่เย็นเป็นสุขทุกคืนวัน เกษมสันต์แสนสมอารมณ์เอย ฯ "
    },
    { 
      "id": 16,  
      "description": "ใบที่สิบหกว่าเลิศประเสริฐนัก ว่ามีศักดิ์อำนาจวาสนา พร้อมด้วยสุขสนุกสบายกายวิญญา อยู่ทุกวันทุกเวลาไม่คลาคลาย จะหวังลาภอาจสมอารมณ์คิดได้ดังจิต มุ่งมาดเหมือนคาคหมาย จะหวังคู่ชู้ชิดสนิทกาย พาทีทายว่าดีเป็นศรีตัว ถามคนเจ็บหายสนิทดังปลิดทิ้ง ถ้วนทุกสิ่งใบนี้ไม่มีชั่ว ดังเพ็ญจันทร์พิศมองไม่หมองมัว สว่างทั่วฟ้าจบพิภพเอย ๆ"
    },
    { 
      "id": 17,  
      "description": "ใบที่สิบเจ็ดเสร็จความว่างามเลิศ แสนประเสริฐสั่งสมอารมณ์หมาย จะตกถิ่นฐานใดไม่อดตาย ทั้งหญิงชายเสน่หาเมตตาตน อันลากนั้นว่าเป็นศรีไม่มีขาด เปรียบดังพฤกษชาติที่คืนผล ทั้งแก่อ่อนมีคละอยู่ปะปน งอมก็หล่นเราลิ้มอิ่มอุรา ใบนี้ถามถึงคู่จะสู่สม คงได้ชมพูพักตร์เป็นหนักหนา ถามถึงบุตรสดสวาทไม่คลาดคลา เป็นบุตราถูกแท้อย่างแน่นอน ถามญาติมิตรหรือหนี้ที่หน่ายพักตร์ ว่าคงจักได้พบสบสลอน อันเรื่องความนั้นเป็นต่อข้อสุนทร จบคำกลอนพาทีเท่านี้เอย ฯ"
    },
    { 
      "id": 18,  
      "description": "ใบที่สิบแปดพยากรณ์สุนทรเฉลย ด้วยกุศลบุญเคยสร้างไว้ปางก่อน มาเพิ่มพรแก่ชีวิตให้สมหมายจะน้อมนำให้สบายและเบิกบาน ท่านจะมีถิ่นฐานบ้านสำนัก และยศศักดิ์สิ่งห้อมพร้อมสมาน ทั้งข้าทาสอีกทรัพย์ศฤงคาร ทุกแรมวารสุขนี้ไม่มีคลาย เปรียบเห็นเช่นพระยาราชสีห์ ซึ่งล้วนมีบริวารนั้นมากหลาย คอยพิทักษ์รักล้อมอยู่รอบกาย จะมิวายสุขซาบอาบทรวงเอย ฯ"
    },
    { 
      "id": 19,  
      "description": "ใบที่สิบเก้ามีความสุขสิ้นทุกข์ร้อน ท่านสุนทรจริงจังดังว่าขาน จะปราศทุกข์สุขใจให้เบิกบาน อยู่ทุกทิวาราตรีไม่มีเลือน จะหวังลาภอาบสมอารมณ์ปอง ทั้งคู่ครองดีกระไรใครจะเหมือน ลาภหรือคู่สู่แน่ไม่แชเชือน ในสามเดือนนี้ไซร่ไม่คลาดคลา แม้เป็นความก็จะชนะเขา ความของเราจะเป็นต่อในข้อหา ถามตามญาติลูกหนี้หนีพักตรา ขอทายว่าคงประสบพบยินดี จะสู่ถิ่นฐานใดไม่ตกอับ คนจะนับหน้าพร้อมน้อมศักดิ์ศรี ยิ่งแก่ตัวยิ่งเพิ่มเสริมความดี จบใบนี้ว่าประเสริฐเลิศนักเอย ฯ "
    },
    { 
      "id": 20,  
      "description": "ใบที่ยี่สิบนี้แจ้งแถลงไข ดังคนจรเดินบำพนาลัย ลัดวิถีทางไกลในพนา ต้องโดนหนามเกี่ยวกีดขีดกางกั้น แต่คงดั้นดันไปได้ถูกท่า ไม่มากนักหนามเหนี่ยวเกี่ยวกายา คงไคลคลาลุสมอารมณ์ป่องถามหาลาภว่าได้เหมือนใจคิด แต่ติดนิดอปสรรคมักขัดข้อง จะเป็นปากเป็นเสียงเถียงประลอง แล้วคงต้องสมประสงค์ตรงใจเรา แม้เป็นความมาถึงซึ่งโรงศาล ถ้าคิดอ่านดีแน่ไม่แพ้เขา ถามคนไข้ว่าหายคลายบรรเทา คู่นั้นเล่าแม้จะมีก็ดีเอย ฯ"
    },
    { 
      "id": 21,  
      "description": "ใบที่ยี่สิบเอ็ดอย่าภวังค์นึกกังขา เปรียบเหมือนเรานั่งอยู่ในนาวา แล้วแล่นฝ่าคลื่นลมตะบมไป ย่อมสั่นไหวตามคลื่นกระแสลม อันโชคลาภนั้นหนาว่ายังขัด ยังอึดอัดมิเห็นหนทางได้ รออีกหน่อยจะสุขสนุกใจ คงรวยใหญ่ยิ่งเกษมเปรมปรีดี ถามคนเจ็บว่าหายสบายจิต ถามจะคิดสู้ความตามวิถี จะแพ้เขาทุกเรื่องไปไม่มีดี เนื้อคมีพอหวังยังอยู่ไกล ถามหาบุตรสุดรักยังหนักจิต อย่าเพิ่งคิดเพราะยังหวังมิได้ ต้องรอหน่อยคอยนิดค่อยคิดไป มิเท่าไรคงสมอารมณ์เอย ฯ "
    },
    { 
      "id": 22,  
      "description": "ใบที่ยี่สิบสองว่าเลิศประเสริฐแสน จะดกถิ่นฐานใดไม่ขาดแคลน ข้อที่แค้นเคืองขุ่นไม่วุ่นวาย ผู้ใหญ่เป็นคู่ชุบอุปถัมภ์ จะแนะนำความสุขสิทธิ์สมหมาย ลาภจะมีเสมออยู่มิรู้วาย ล้วนสบายสวัสดีเป็นศรีตัว ถามถึงเรื่องเนื้อคู่จะสู่สม ดังคารมว่าดีไม่มีชั่ว ถามสู้ความนั้นหนาก็อย่ากลัว ที่หมองมัวจะสว่างกระจ่างใจ ท่านเสี่ยงได้ใบนี้เป็นที่ชื่น ทุกวันคืนจะเปรมเกษมใส ดังเด็กอ่อนนอนเปลเขาเหไกว พี่เลี้ยงได้คอยพิทักษ์รักษาเอย ฯ"
    },
    { 
      "id": 23,  
      "description": "ใบที่ยี่สิบสามความว่าเภตราใหญ่ ซึ่งแล่นไปในมหาชลาสินธ์ ขนบรรทุกสินค้าอยู่อาจิณ ไม่หมดสิ้นมีสุขทุกคืนวัน ใครเสี่ยงได้ใบนี้ว่าดีนัก ลาภนั้นจักเนืองนองเป็นของขวัญ จะค้าขายก็มีผลดีครัน อย่าได้พรั่นความคิดตามจิตปอง ถ้าจะถามหารู้เนื้อคู่สร้าง ประเสริฐอย่างแสนดีไม่มีสอง จะสมเนื้อสมรักสมศักดิ์ครอง ไม่มีหมองคงสุขทกเวลา ถามคนเจ็บว่าคลายจะหายขาด แม้นวิวาทเป็นความตามกล่าวหา จะชนะสมถวิลดังจินดา ดั่งสารากล่าวแจ้งแถลงเอย ฯ "
    },
    { 
      "id": 24,  
      "description": "ใบที่ยี่สิบสี่ว่าสมอารมณ์คิด ความในจิดจะสำเร็จเร็จเสร็จเหมือนหมาย จะปราศทุกข์สุขเพิ่มเสริมสบายไม่คลาดคลายดังคำพยากรณ์ แต่ช้าหน่อยเช่นเท้าก้าวบันไค ทีละขั้นขึ้นไปไม่หยุดหย่อน ทางเรียบราบทาบรดบทจร ถึงยอดสดสโมสรสวัสดี อันทุกข์โศกโรคภัยจะหายหมด ดังทรงกลดจันทร์งามอร่ามศรี ถามหาลาภได้สมฤดีปรีดิ์ ถามลูกหนี้น้องต้องพบกัน ถามเนื้อคู่ชู้ร่วมภิรมย์รัก ว่าดีนักสุขเปรมเกษมสันด์ แต่ช้าหน่อยได้ชมสมใจครัน จบประพันธ์คำทายภิปรายเอย ฯ"
    },
    { 
      "id": 25,  
      "description": "ใบที่ยี่สิบห้าความลำบากยากเหลือแสน จะตกถิ่นฐานใดให้ขาดแคลน เฝ้าแต่แค้นเคืองอยู่มีร้วาย จะกินนอนร้อนใจไม่เป็นสุข มีแต่ทกข์เพิ่มพูนไม่สญหาย เหล่าศัตรูแห่ห้อมล้อมรอบกาย ทายว่าร้ายจงเร่งระวังตัว ถามหาลาภล้วนยากลำบากลัน แต่เป็นความนั้นพ้นข้อที่ชั่ว ถ้าถามพวกลูกหนี้ที่พันพัว ว่ามืดมัวไม่ประสบได้พบพาน ถามถึงซ์ค่เคียงจะเรียงพักตร์ อย่าได้ฝึกใฝ่เห็นเป็นแก่นสาร มีแต่ร้ายร้อนทำให้รำคาญ สงบการยั้งสติตริตรองเอย ฯ "
    },
    { 
      "id": 26,  
      "description": "ใบที่ยี่สิบหกนี้ว่าชะตาขัด ลาภบอกชัดไม่เห็นจะเป็นผล มักมีทุกข์ขัดข้องต้องหมองมล โชคของดนเช่นนั้นหมดปัญญา ดังรับจ้างแจวเรืออยู่กลางน้ำ วันยังต่ำจำจ้ำเหนื่อยเมื่อยแขนขนขา จึงได้อัฐพอหล่อเลี้ยงกายา ที่ได้มากินหมดไม่อดตาย ชะตาท่านตัวคนเดียวน่าเปลี่ยวจิด จะหวังคิดที่พึ่งอย่าพึงหมาย ถ้ามีคู่จักชำระกำกาย ถามของหายไม่ประสบได้พบพาน เร่งอุดสาห์แสวงหาทางกุศล จะช่วยตนค่อยสุขเกษมศานด์ ดีแต่ที่เหล่าพวกอันธพาล ไม่รุกรานจงจิตคิดร้ายเอย ฯ"
    },
    { 
      "id": 27,  
      "description": "ใบที่ยี่สิบเจ็ดความว่าเภตราใหญ่ ซึ่งแล่นไปในมหาชลาสินธุ์ ขนบรรทุกสินค้าอยู่อาจิณ ไม่หมดสิ้นมีสุขทุกคืนวัน ใครเสี่ยงได้ใบนี้ว่าดีนัก ลากนั้นจักเนื่องนองเป็นของขวัญ จะค้าขายก็มีผลดีครั้น อย่าได้พรั่นความคิดตามจิตปอง แม้นถามถึงหารู้เนื้อคู่สร้าง ประเสริฐอย่างแสนดีไม่มีสอง จะสมเนื้อสมรักสมศักดิ์ครอง ไม่มีหมองคงสุขทุกเวลา ถามคนเจ็บว่าคลายจะหายขาด ข้อวิวาทเรื่องเป็นความตามกล่าวหา เขาแพ้เราย่อยยับอัปรา เสี่ยงสาราใบนี้ดีนักเอย ฯ "
    },
    { 
      "id": 28,  
      "description": "ใบที่ยี่สิบแปดว่ากรรมตามสนอง จะหาลาภเหลือยากลำบากปอง มักขัดข้องน้อมปากรรมของเรา ผิเปรียบความตามทำนองที่ครองตน ก็เช่นคนกลิ้งครกขึ้นภูเขา มันแสนเหนื่อยแสนลำบากยากไม่เบากระดกเราแทบแยกแดกทำลาย ถามทุกข์โศกโรคภัยไม่ร้ายนัก เรื่องคนรักยังไม่สมอารมณ์หมาย ยังอยู่ไกลหนักหนาอย่าวุ่นวาย มิดรสหายไม่เป็นเรื่องจะเคืองตน ถามหาเหล่าลูกหนี้คนหนีหลบ ว่าไม่พบทั่วแหล่งทุกแห่งหน แม้นถามบุตรในท้องอย่าหมองมล บอกยุบลว่าหญิงจริงเจียวเอย ฯ"
    }
]

export default Destiny;
