const hotels = [
  { 
    "id": 1, 
    "name_th": "โรงแรมเซ็น นครปฐม", 
    "name_en": "Xen Hotel Nakhon Pathom",
    "rating": "8.6",
    "price": "900 บาท / คืน",
    "location": "528/329 ถนนราชมรรคา สนามจันทร์, นครปฐม, นครปฐม, ไทย, 73000",
    "description": "ตั้งอยู่ใจกลางเมืองนครปฐม บนถนนราชมรรคาและถนนเพชรเกษมทำเลที่ตั้งสะดวกสบายสำหรับการสำรวจสถานที่ท่องเที่ยวสำคัญ เช่น พระปฐมเจดีย์ ซึ่งเป็นสัญลักษณ์ของจังหวัด",
    "url": "https://maps.app.goo.gl/hReEN3o3rRWwqUuF8"
  },
  { 
    "id": 2, 
    "name_th": "เดอะพราว เอ็กซ์คลูซีฟ โฮเทล",
    "name_en": "The Proud Exclusive Hotel", 
    "rating": "8.6",
    "price": "1780 บาท / คืน",
    "location": "100 ถนนราชมรรคคา ตำบลสนามจันทร์ อำเภอเมืองนครปฐม จังหวัดนครปฐม, นครปฐม, นครปฐม, ไทย, 73000",
    "description": "เพลิดเพลินไปกับบรรยากาศสวนอันเงียบสงบ ฟิตเนส สระว่ายน้ำกลางแจ้ง ร้านอาหารภายในโรงแรม และร้านกาแฟบรรยากาศสบาย ๆ ตั้งอยู่ในทำเลที่สะดวกสำหรับการสำรวจสถานที่ท่องเที่ยวในบริเวณใกล้เคียง โรงแรมอันเงียบสงบแห่งนี้ตั้งอยู่ในจังหวัดนครปฐม มอบมรดกทางวัฒนธรรมอันมั่งคั่ง และสามารถเดินทางไปยังสถานที่ท่องเที่ยวต่าง ๆ เช่น วัดพระปฐมเจดีย์ได้โดยสะดวก",
    "url": "https://maps.app.goo.gl/RJn7dt4FHqrvVwob9"
  },
  { 
    "id": 3, 
    "name_th": "โรงแรมเทรนดี้", 
    "name_en": "Trendy Hotel",
    "rating": "8.5",
    "price": "890 บาท / คืน",
    "location": "248/7 ถนนยิงเป้า ตำบลสนามจันทร์ อำเภอเมือง, นครปฐม, นครปฐม, ไทย, 73000",
    "description": "โรงแรมตั้งอยู่ใจกลางเมือง สามารถเดินทางไปยังวัดพระปฐมเจดีย์และพระราชวังสนามจันทร์ได้อย่างง่ายดาย เพลิดเพลินกับห้องพักหรูหราทันสมัยพร้อมเครื่องปรับอากาศและวิวเมืองจากส่วนตัวของคุณ ระเบียง/ชานเรือน เชื่อมต่ออินเทอร์เน็ตด้วย Wi-Fi ฟรีและดื่มด่ำไปกับตัวเลือกการรับประทานอาหารชั้นเลิศ",
    "url": "https://maps.app.goo.gl/ZcfVQDcwSh7D9WJs8"
  },
  { 
    "id": 4, 
    "name_th": "โรงแรมฮ็อป อินน์ นครปฐม ",
    "name_en": "Hop Inn Nakhon Pathom", 
    "rating": "9.0",
    "price": "780 บาท / คืน",
    "location": "554 Tanon Rachamanka, Tambon Sanam Chan, Amphoe Mueang Nakhon Pathom, 73000",
    "description": "โรงแรมพิเศษแห่งนี้มอบบรรยากาศอันเงียบสงบที่รายล้อมไปด้วยมรดกทางวัฒนธรรมที่มีชีวิตชีวา ค้นพบอัญมณีที่ซ่อนอยู่ เช่น วัดพระปฐมเจดีย์และพระราชวังสนามจันทร์ในบริเวณใกล้เคียง เพลิดเพลินไปรอบ ๆ - บริการเจ้าหน้าที่อำนวยความสะดวกตลอด 24 ชั่วโมง",
    "url": "https://maps.app.goo.gl/shmvHxRNhPrEjpRz9"
  },
  { 
    "id": 5, 
    "name_th": "โรงแรมริเวอร์ นครปฐม", 
    "name_en": "RIVER HOTEL", 
    "rating": "8.3",
    "price": "750 บาท / คืน",
    "location": "1156 ถ.เพชรเกษม ต.สนามจันทร์ อ.เมือง, นครปฐม ",
    "description": "ที่พักให้บริการที่จอดรถฟรีเพื่อการเดินทางเข้าออกที่พักได้อย่างสะดวกสบาย รวมถึง Wi-Fi ฟรีให้ท่องเน็ตได้ทุกเมื่อ ที่พักตั้งอยู่ในย่านนครปฐม จึงอยู่ใกล้กับที่เที่ยวมากมาย และสะดวกต่อการเดินทางไปสถานที่ต่างๆ ที่พัก 3 ดาวคุณภาพสูงแห่งนี้มี บริการนวด, ห้องซาวน่า และ ห้องอาหาร คอยอำนวยความสะดวกแก่ผู้เข้าพัก",
    "url": "https://maps.app.goo.gl/SxHUKZNxzxq4ayiv7"
  },
  { 
    "id": 6, 
    "name_th": "ราชพฤกษ์ พาวิลเลี่ยน", 
    "name_en": "Ratchaphruek Pavilion", 
    "rating": "8.4",
    "price": "630 บาท / คืน",
    "location": "Rotfai Tawan Tok, หนองปากโลง อำเภอเมืองนครปฐม นครปฐม 73000",
    "description": "ที่พักตัวเมืองนครปฐม ใกล้มหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์และสถานที่ท่องเที่ยวสำหรับสายบุญอย่างองค์พระปฐมเจดีย์ซึ่งเป็นสัญลักษณ์ของเมืองนครปฐมเลย อยู่ห่างออกไปโดยใช้เวลาเดินทางประมาณ 5 นาที บรรยากาศรอบๆค่อนข้างเงียบสงบ มีห้องพักให้บริการ 6 Room Type",
    "url": "https://maps.app.goo.gl/kvewLSSKxTHLKjcs5"
  },
  { 
    "id": 7, 
    "name_th": "โรงแรมแอทสลีป นครปฐม",
    "name_en": "@Sleep Hotel Nakhon Pathom",  
    "rating": "8.9",
    "price": "730 บาท / คืน",
    "location": "Rotfai Tawan Tok, หนองปากโลง อำเภอเมืองนครปฐม นครปฐม 73000",
    "description": "@Sleep โอเอซิสอันเงียบสงบในจังหวัดนครปฐม นครปฐม โรงแรมแห่งนี้จะมอบประสบการณ์ทางวัฒนธรรมที่หลากหลาย พร้อมการเข้าถึงสถานที่ท่องเที่ยว อย่างวัดพระปฐมเจดีย์ และพระราชวังสนามจันทร์ได้อย่างง่ายดาย เพลิดเพลินไปกับ บริการที่เอาใจใส่ตลอด 24 ชั่วโมงทุกวัน และสิ่งอำนวยความสะดวก ที่สะดวกสบาย",
    "url": "https://maps.app.goo.gl/ghPDixmgqPcZsBxT8"
  },
  { 
    "id": 8, 
    "name_th": "ไมด้า แกรนด์ ทวารวดี นครปฐม", 
    "name_en": "Mida Grande Hotel  Dhavaravati",  
    "rating": "8.5",
    "price": "630 บาท / คืน",
    "location": "711 ถนนเพชรเกษม ห้วยจระเข้, นครปฐม, นครปฐม, ไทย, 73000",
    "description": "สัมผัสประสบการณ์ที่ดีที่สุดของนครปฐมที่โรงแรมไมด้า แกรนด์ ทวารวดี เหมาะสำหรับนักเดินทางสองคนที่กำลังมองหาสถานที่พักผ่อนอันเงียบสงบพร้อมการเข้าถึงสถานที่ท่องเที่ยวทางวัฒนธรรมที่ง่ายดาย เพลิดเพลินไปกับบรรยากาศอันเงียบสงบ สิ่งอำนวยความสะดวกที่หรูหรา ห้องพักกว้างขวาง พร้อม WiFi ที่รวดเร็ว และทิวทัศน์อันตระการตา ดื่มด่ำกับความสดชื่น สระว่ายน้ำและห้องอบไอน้ำเพื่อการฟื้นฟู",
    "url": "https://maps.app.goo.gl/LDYkSyJduQ95sv2x5"
  },
  { 
    "id": 9, 
    "name_th": "โรงแรม ไดอารี่ สวีท",
    "name_en": "Diary Suite Hotel",  
    "rating": "8.2",
    "price": "630 บาท / คืน",
    "location": "54/2 ต.สนามจันทร์ อ.เมือง, นครปฐม, นครปฐม, ไทย, 73000",
    "description": "หลีกหนีสู่นครปฐมอันเงียบสงบและมั่งคั่งทางวัฒนธรรมในจังหวัดนครปฐม ที่ซึ่งโรงแรมไดอารี่ สวีท รอคอยที่จะยกระดับประสบการณ์การเดินทางของคุณ ที่พักพิเศษแห่งนี้เป็นสวรรค์สำหรับนักเดินทางสองคน ทำให้สามารถเดินทางไปยังสถานที่ท่องเที่ยวที่มีชื่อเสียง เช่น วัดพระปฐมเจดีย์และพระราชวังสนามจันทร์ได้อย่างง่ายดาย",
    "url": "https://maps.app.goo.gl/pghA4pUDR6fZUY7N6"
  }
]

export default hotels;