const restaurants = [
  { 
    "id": 1, 
    "name": "ครัวลุงหนุ่ม ", 
    "typefood": "อาหารไทย",
    "rating": "4.6",
    "price": "ตํ่ากว่า 100 บาท",
    "description": "ชวนครอบครัวไปกินข้าวที่ร้าน ครัวลุงหนุ่มนครปฐม ร้านอาหารสไตล์บ้านสวนริมคลอง บรรยากาศดี นั่งสบายริมน้ำ ร้านโปร่งโล่งมีที่นั่งให้เลือกเยอะมาก ส่วนเรื่องอาหารคือทีเด็ด ทางร้านเสิร์ฟอาหารไทยรสชาติจัด มีเมนูให้เลือกหลากหลาย บอกเลยว่าดีงามทุกเมนู อย่างเมนูแนะนำ ปลากะพงทอดน้ำปลา ต้มยำปลาคังน้ำใส และ ปลาช่อนเผาเกลือ ตัวร้านอยู่ติดถนนเลียบคลองประปานาสร้าง เดินทางง่ายห่างจากองค์พระประมาณ 10 นาที",
    "url": "https://maps.app.goo.gl/4hk2LtpC9xdtCPTw6",
    "phone_number": "080-987-9498"
  },
  { 
    "id": 2, 
    "name": "กุ้งอบภูเขาไฟ ", 
    "typefood": "อาหารทะเล",
    "rating": "4.1",
    "price": "250-500 บาท",
    "description": "มาถึงร้านกุ้งภูเขาไฟทั้งทีเมนูที่ต้องสั่งกันแทบทุกโต๊ะคือ กุ้งอบภูเขาไฟ นั่นแหละจ้า กุ้งมีให้เลือก 2 ไซส์ สั่งอย่างละครึ่งโล ไซส์ใหญ่เอามาอบภูเขาไฟ ส่วนไซส์เล็กผัดพริกกระเทียมู กุ้งอบภูเขาไฟ ไซส์ใหญ่ครึ่งกิโลได้มา 6 ตัวโตอวบ ๆ เนื้อแน่นหัวมันเยิ้ม ในถาดมีน้ำมันราดมาอบพร้อมกับพริกไทยดำกับซีอิ๊ว รสชาติเค็ม ๆ มันๆ ดูดเปลือกกุ้งเพลินมาก ตอนมาเสิร์ฟน้องพนักงานจะจุดไฟลุก ตื่นตาตื่นใจดีแท้",
    "url": "https://maps.app.goo.gl/iiU28upLnHmcVjYr7",
    "phone_number": "034-241-109"
  },
  { 
    "id": 3, 
    "name": "ติ๊กโภชนา ", 
    "typefood": "อาหารไทย",
    "rating": "3.6",
    "price": "250-500 บาท",
    "description": "มาไหว้องค์พระทั้งทีก็ต้องมาฝากท้องร้านนี้ เราสั่ง “ไข่เจียวหมูสับ” ไข่เจียวฟู หนา กรอบนอกนุ่มใน สีสวยน่ากิน เสิร์ฟพร้อมซอสพริก ต่อด้วย “ห่อหมกปลาช่อน” กระทงใหญ่พอประมาณ รสชาติเข้มข้น หอมเครื่องแกง เนื้อปลาช่อนเยอะ รสจัดจ้าน เมนู “ปลาช่อนทอดน้ำปลา” ทอดออกมาสีเหลืองสวยงาม กรอบแห้ง มีมะม่วงดิบซอย หอมแดง และพริก มีน้ำปลาพริกสูตรของทางร้านแยกไว้ โดยรวมอาหารรสชาติใช้ได้ ปริมาณอาหารต่อจานสมเหตุสมผล",
    "url": "https://maps.app.goo.gl/c7efyvkMLYaTKbjp7",
    "phone_number": "094-241-7753"
  },
  { 
    "id": 4, 
    "name": "หมูย่างผู้ใหญ่มุ่ย ", 
    "typefood": "ปิ้งย่าง",
    "rating": "3.8",
    "price": "ต่ำกว่า 100 บาท",
    "description": "หมูย่างผู้ใหญ่มุ่ย อีกหนึ่งร้านเก่าแก่ของนครปฐม ที่มีชื่อเสียงเรื่องหมูย่างมานานกว่า 40 ปี ตัวร้านตั้งอยู่ริมถนน มีพื้นที่บริการลูกค้าทั้งโซนด้านนอก และในห้องแอร์ ลานจอดรถ อยู่ด้านหลังร้าน รองรับได้จำนวนค่อนข้างมาก",
    "url": "https://maps.app.goo.gl/vgVMfhFNMHqAhMXPA",
    "phone_number": "081-763-5785"
  },
  { 
    "id": 5, 
    "name": "บัวลอยแต้จิ๋ว ", 
    "typefood": "ของหวาน",
    "rating": "3.9",
    "price": "ต่ำกว่า 100 บาท",
    "description": "บัวลอยแต้จิ๋ว หลายๆคนอาจจะนึกหน้าตาไม่ออกว่า หน้าตาเป็นยังไง เราจะบอกให้ว่าบัวลอยแต้จิ๋ว เป็น เหมือนน้ำแข็งใส ที่ใส่น้ำเชื่อมสีน้ำตาล ไม่แน่ใจว่า น้ำเชื่อมที่เป็นสีน้ำตาลทำจากอะไร เครื่องบัวลอย ประกอบไปด้วย ลูกเดือย ข้าวเหนื่อยสามเหลี่ยม มันเชื่อม วุ้นมะพร้าว ข้าวโพด และ สิ่งที่เป็นซิกเนเจอร์ร้านคือ แป้งเหนียวๆกลมๆแผ่นเท่าเหรียญสิบ กินแล้วมันเพลินดีค่ะ หนึบๆดีค่ะ บรรยากาศร้าน : ร้านอยู่ในองค์พระปฐม เป็นร้านรถเข็น มีที่นั่ง",
    "url": "https://maps.app.goo.gl/gtWK8cVJiX8g82Yx6",
    "phone_number": "095-694-9341"
  },
  { 
    "id": 6, 
    "name": "ข้าวหมูแดงนครปฐม", 
    "typefood": "อาหารไทย",
    "rating": "4.2",
    "price": "ต่ำกว่า 100 บาท",
    "description": "จังหวัดนครปฐม เป็นที่เที่ยวใกล้กรุงเทพฯ ที่มีแหล่งท่องเที่ยวนครปฐมซ่อนตัวอยู่มากมาย ร้านอาหารอร่อย ๆ ก็เช่นกันค่ะ มีให้เลือกลิ้มลองหลากหลายเมนูเลยทีเดียว คราวนี้เราจะพาไปทำความรู้จักกับร้านข้าวหมูแดง นครปฐม กันบ้าง บอกเลยว่าแต่ละร้านน่าโดนมาก ๆ",
    "url": "https://maps.app.goo.gl/pqg4zUMeBPvtRMJd9",
    "phone_number": "083-462-2359"
  },
  { 
    "id": 7, 
    "name": "วุ้นคุณอุ๊", 
    "typefood": "ขนุมหวาน",
    "rating": "3.8",
    "price": "ต่ำกว่า 100 บาท",
    "description": "ร้านขนมหวานชื่อดังเมืองนครปฐม ร้านแรกที่เปิดและค้าขายขนมหวาน ที่ทำง่าย ราคาถูก คือ “วุ้น” นั่นเอได้ยินชื่อเสียงมาก็นมนาน ทั้งได้เคยชิมกันจนอิ่มมาหลายทีหลายหน จนได้ตระเวนมาเจอเองกับร้านวุ้นคุณอุ๊ ที่หลายคนคงคุ้นหูคุ้นตา เพราะตอนนี้วุ้นคุณอุ๊เค้าได้ขยายสาขาเพิ่มมากขึ้น แต่วันนี้พามาชิมเองกับร้านวุ้นคุณอุ๊ (สาขาแรก) ที่จังหวัดนครปฐม เป็นเพียงร้านเล็ก ห้องเดียว แต่ภายในก็เต็มไปด้วยขนมหวานน่าตาน่าทาน ที่มีชื่อว่า วุ้น ",
    "url": "https://maps.app.goo.gl/7tX2rgev5aMU9KHF8",
    "phone_number": "088-800-9855"
  }
  ,
  { 
    "id": 8, 
    "name": "ครัวอภิรัตต์", 
    "typefood": "ก๋วยเตี๋ยว",
    "rating": "3.8",
    "price": "ต่ำกว่า 100 บาท",
    "description": "ครัวอภิรัตต์ ต้นสน เมนูเด็ดที่จะมาแนะนำให้ลองวันนี้คือก๋วยเตี๋ยวต้มยำชามหมู ที่นี่เค้าเรียกกันว่าหมูทุบ รสชาติเข้มข้น อร่อย ไม่ต้องปรุงเพิ่มเลย เครื่องหมูที่ใส่มาคือเด็ด‼️ หมูย่างนี่บอกเลย นุ่มมาก อร่อยจนต้องสั่งกลับบ้านอีกแล้ว เกี๊ยวผัดซีอิ๊ว หอมกลิ่นกระทะคั่วไข่ เพิ่งเคยทาน เพราะปกติทานแต่เส้นใหญ่ เส้นหมี่ พอมาเป็นเกี๊ยวก็ดีนะ ",
    "url": "https://maps.app.goo.gl/X5G78rpu5W1VHKcj6",
    "phone_number": "091-738-8897"
  }
]

export default restaurants;